OpenNuvoton/M480BSP/Library/USB_Host/src_core/urb.c
    //wait_event(usb_kill_urb_queue, atomic_read(&urb->use_count) == 0);
    atomic_dec(&urb->reject);
}

/**
 * usb_poison_urb - reliably kill a transfer and prevent further use of an URB
 * @urb: pointer to URB describing a previously submitted request,
 *  may be NULL
 *
 * This routine cancels an in-progress request.  It is guaranteed that
 * upon return all completion handlers will have finished and the URB
 * will be totally idle and cannot be reused.  These features make
 * this an ideal way to stop I/O in a disconnect() callback.
 * If the request has not already finished or been unlinked
 * the completion handler will see urb->status == -ENOENT.
 *
 * After and while the routine runs, attempts to resubmit the URB will fail
 * with error -EPERM.  Thus even if the URB's completion handler always
 * tries to resubmit, it will not succeed and the URB will become idle.
 *
 * This routine may not be used in an interrupt context (such as a bottom
 * half or a completion handler), or when holding a spinlock, or in other
 * situations where the caller can't schedule().
 *
 * This routine should not be called by a driver after its disconnect
 * method has returned.
 */
void usb_poison_urb(struct urb *urb)
{
    might_sleep();
    if (!(urb && urb->dev && urb->ep))
        return;
    atomic_inc(&urb->reject);

    usb_hcd_unlink_urb(urb, -ENOENT);
    //wait_event(usb_kill_urb_queue, atomic_read(&urb->use_count) == 0);
}

void usb_unpoison_urb(struct urb *urb)
{
    if (!urb)
        return;

    atomic_dec(&urb->reject);
}

/**
 * usb_kill_anchored_urbs - cancel transfer requests en masse
 * @anchor: anchor the requests are bound to
 *
 * this allows all outstanding URBs to be killed starting
 * from the back of the queue
 *
 * This routine should not be called by a driver after its disconnect
 * method has returned.
 */
void usb_kill_anchored_urbs(struct usb_anchor *anchor)
{
    struct urb *victim;

    spin_lock_irq(&anchor->lock);
    while (!list_empty(&anchor->urb_list)) {
        victim = list_entry(anchor->urb_list.prev, struct urb,
                            anchor_list);
        /* we must make sure the URB isn't freed before we kill it*/
        usb_get_urb(victim);
        spin_unlock_irq(&anchor->lock);
        /* this will unanchor the URB */
        usb_kill_urb(victim);
        usb_put_urb(victim);
        spin_lock_irq(&anchor->lock);
    }
    spin_unlock_irq(&anchor->lock);
}


/**
 * usb_poison_anchored_urbs - cease all traffic from an anchor
 * @anchor: anchor the requests are bound to
 *
 * this allows all outstanding URBs to be poisoned starting
 * from the back of the queue. Newly added URBs will also be
 * poisoned
 *
 * This routine should not be called by a driver after its disconnect
 * method has returned.
 */
void usb_poison_anchored_urbs(struct usb_anchor *anchor)
{
    struct urb *victim;

    spin_lock_irq(&anchor->lock);
    anchor->poisoned = 1;
    while (!list_empty(&anchor->urb_list)) {
        victim = list_entry(anchor->urb_list.prev, struct urb,
                            anchor_list);
        /* we must make sure the URB isn't freed before we kill it*/
        usb_get_urb(victim);
        spin_unlock_irq(&anchor->lock);
        /* this will unanchor the URB */
        usb_poison_urb(victim);
        usb_put_urb(victim);
        spin_lock_irq(&anchor->lock);
    }
    spin_unlock_irq(&anchor->lock);
}

/**
 * usb_unpoison_anchored_urbs - let an anchor be used successfully again
 * @anchor: anchor the requests are bound to
 *
 * Reverses the effect of usb_poison_anchored_urbs
 * the anchor can be used normally after it returns
 */
void usb_unpoison_anchored_urbs(struct usb_anchor *anchor)
{
    //unsigned long flags;
    struct urb *lazarus;

    spin_lock_irqsave(&anchor->lock, flags);

#if 1   // list_for_each_entry() macro expanded
    for (lazarus = list_entry((&anchor->urb_list)->next, struct urb, anchor_list);
            &lazarus->anchor_list != (&anchor->urb_list);
            lazarus = list_entry(lazarus->anchor_list.next, struct urb, anchor_list)) {
#else
    list_for_each_entry(lazarus, &anchor->urb_list, anchor_list) {
#endif
        usb_unpoison_urb(lazarus);
    }

    anchor->poisoned = 0;
    spin_unlock_irqrestore(&anchor->lock, flags);
}

/**
 * usb_unlink_anchored_urbs - asynchronously cancel transfer requests en masse
 * @anchor: anchor the requests are bound to
 *
 * this allows all outstanding URBs to be unlinked starting
 * from the back of the queue. This function is asynchronous.
 * The unlinking is just tiggered. It may happen after this
 * function has returned.
 *
 * This routine should not be called by a driver after its disconnect
 * method has returned.
 */
void usb_unlink_anchored_urbs(struct usb_anchor *anchor)
{
    struct urb *victim;

    while ((victim = usb_get_from_anchor(anchor)) != NULL) {
        usb_unlink_urb(victim);
        usb_put_urb(victim);
    }
}

/**
 * usb_wait_anchor_empty_timeout - wait for an anchor to be unused
 * @anchor: the anchor you want to become unused
 * @timeout: how long you are willing to wait in milliseconds
 *
 * Call this is you want to be sure all an anchor's
 * URBs have finished
 */
int usb_wait_anchor_empty_timeout(struct usb_anchor *anchor,
                                  unsigned int timeout)
{
#ifdef NUVOTON_PORTED
    return 0;
#else
    return wait_event_timeout(anchor->wait, list_empty(&anchor->urb_list),
                              msecs_to_jiffies(timeout));
#endif
}

/**
 * usb_get_from_anchor - get an anchor's oldest urb
 * @anchor: the anchor whose urb you want
 *
 * this will take the oldest urb from an anchor,
 * unanchor and return it
 */
struct urb *usb_get_from_anchor(struct usb_anchor *anchor)
{
    struct urb *victim;
    //unsigned long flags;

    spin_lock_irqsave(&anchor->lock, flags);
    if (!list_empty(&anchor->urb_list)) {
        victim = list_entry(anchor->urb_list.next, struct urb,
                            anchor_list);
        usb_get_urb(victim);
        __usb_unanchor_urb(victim, anchor);
    } else {
        victim = NULL;
    }
    spin_unlock_irqrestore(&anchor->lock, flags);

    return victim;
}


/**
 * usb_scuttle_anchored_urbs - unanchor all an anchor's urbs
 * @anchor: the anchor whose urbs you want to unanchor
 *
 * use this to get rid of all an anchor's urbs
 */
void usb_scuttle_anchored_urbs(struct usb_anchor *anchor)
{
    struct urb *victim;
    //unsigned long flags;

    spin_lock_irqsave(&anchor->lock, flags);
    while (!list_empty(&anchor->urb_list)) {
        victim = list_entry(anchor->urb_list.prev, struct urb,
                            anchor_list);
        __usb_unanchor_urb(victim, anchor);
    }
    spin_unlock_irqrestore(&anchor->lock, flags);
}


/**
 * usb_anchor_empty - is an anchor empty
 * @anchor: the anchor you want to query
 *
 * returns 1 if the anchor has no urbs associated with it
 */
int usb_anchor_empty(struct usb_anchor *anchor)
{
    return list_empty(&anchor->urb_list);
}


/// @endcond HIDDEN_SYMBOLS
